RT-Thread/rt-thread/bsp/stm32/libraries/STM32L5xx_HAL/STM32L5xx_HAL_Driver/Inc/stm32l5xx_hal_dma.h
  DMAMUX_Channel_TypeDef           *DMAmuxChannel;                                      /*!< Register base address                */

  DMAMUX_ChannelStatus_TypeDef     *DMAmuxChannelStatus;                                /*!< DMAMUX Channels Status Base Address  */

  uint32_t                         DMAmuxChannelStatusMask;                             /*!< DMAMUX Channel Status Mask           */

  DMAMUX_RequestGen_TypeDef        *DMAmuxRequestGen;                                   /*!< DMAMUX request generator Base Address */

  DMAMUX_RequestGenStatus_TypeDef  *DMAmuxRequestGenStatus;                             /*!< DMAMUX request generator Address     */

  uint32_t                         DMAmuxRequestGenStatusMask;                          /*!< DMAMUX request generator Status mask */


}DMA_HandleTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_Error_Code DMA Error Code
  * @{
  */
#define HAL_DMA_ERROR_NONE                 0x00000000U    /*!< No error                                */
#define HAL_DMA_ERROR_TE                   0x00000001U    /*!< Transfer error                          */
#define HAL_DMA_ERROR_NO_XFER              0x00000004U    /*!< Abort requested with no Xfer ongoing    */
#define HAL_DMA_ERROR_TIMEOUT              0x00000020U    /*!< Timeout error                           */
#define HAL_DMA_ERROR_NOT_SUPPORTED        0x00000100U    /*!< Not supported mode                      */
#define HAL_DMA_ERROR_SYNC                 0x00000200U    /*!< DMAMUX sync overrun  error              */
#define HAL_DMA_ERROR_REQGEN               0x00000400U    /*!< DMAMUX request generator overrun  error */

/**
  * @}
  */

/** @defgroup DMA_request DMA request
  * @{
  */
#define DMA_REQUEST_MEM2MEM            0U  /*!< memory to memory transfer   */

#define DMA_REQUEST_GENERATOR0         1U  /*!< DMAMUX1 request generator 0 */
#define DMA_REQUEST_GENERATOR1         2U  /*!< DMAMUX1 request generator 1 */
#define DMA_REQUEST_GENERATOR2         3U  /*!< DMAMUX1 request generator 2 */
#define DMA_REQUEST_GENERATOR3         4U  /*!< DMAMUX1 request generator 3 */

#define DMA_REQUEST_ADC1               5U  /*!< DMAMUX1 ADC1 request      */
#define DMA_REQUEST_ADC2               6U  /*!< DMAMUX1 ADC2 request      */

#define DMA_REQUEST_DAC1_CH1           7U   /*!< DMAMUX1 DAC1 CH1 request  */
#define DMA_REQUEST_DAC1_CH2           8U   /*!< DMAMUX1 DAC1 CH2 request  */

#define DMA_REQUEST_TIM6_UP            9U   /*!< DMAMUX1 TIM6 UP request   */
#define DMA_REQUEST_TIM7_UP           10U   /*!< DMAMUX1 TIM7 UP request   */

#define DMA_REQUEST_SPI1_RX           11U   /*!< DMAMUX1 SPI1 RX request   */
#define DMA_REQUEST_SPI1_TX           12U   /*!< DMAMUX1 SPI1 TX request   */
#define DMA_REQUEST_SPI2_RX           13U   /*!< DMAMUX1 SPI2 RX request   */
#define DMA_REQUEST_SPI2_TX           14U   /*!< DMAMUX1 SPI2 TX request   */
#define DMA_REQUEST_SPI3_RX           15U   /*!< DMAMUX1 SPI3 RX request   */
#define DMA_REQUEST_SPI3_TX           16U   /*!< DMAMUX1 SPI3 TX request   */

#define DMA_REQUEST_I2C1_RX           17U   /*!< DMAMUX1 I2C1 RX request   */
#define DMA_REQUEST_I2C1_TX           18U   /*!< DMAMUX1 I2C1 TX request   */
#define DMA_REQUEST_I2C2_RX           19U   /*!< DMAMUX1 I2C2 RX request   */
#define DMA_REQUEST_I2C2_TX           20U   /*!< DMAMUX1 I2C2 TX request   */
#define DMA_REQUEST_I2C3_RX           21U   /*!< DMAMUX1 I2C3 RX request   */
#define DMA_REQUEST_I2C3_TX           22U   /*!< DMAMUX1 I2C3 TX request   */
#define DMA_REQUEST_I2C4_RX           23U   /*!< DMAMUX1 I2C4 RX request   */
#define DMA_REQUEST_I2C4_TX           24U   /*!< DMAMUX1 I2C4 TX request   */

#define DMA_REQUEST_USART1_RX         25U   /*!< DMAMUX1 USART1 RX request */
#define DMA_REQUEST_USART1_TX         26U   /*!< DMAMUX1 USART1 TX request */
#define DMA_REQUEST_USART2_RX         27U   /*!< DMAMUX1 USART2 RX request */
#define DMA_REQUEST_USART2_TX         28U   /*!< DMAMUX1 USART2 TX request */
#define DMA_REQUEST_USART3_RX         29U   /*!< DMAMUX1 USART3 RX request */
#define DMA_REQUEST_USART3_TX         30U   /*!< DMAMUX1 USART3 TX request */

#define DMA_REQUEST_UART4_RX          31U  /*!< DMAMUX1 UART4 RX request  */
#define DMA_REQUEST_UART4_TX          32U  /*!< DMAMUX1 UART4 TX request  */
#define DMA_REQUEST_UART5_RX          33U  /*!< DMAMUX1 UART5 RX request  */
#define DMA_REQUEST_UART5_TX          34U  /*!< DMAMUX1 UART5 TX request  */

#define DMA_REQUEST_LPUART1_RX        35U  /*!< DMAMUX1 LP_UART1_RX request */
#define DMA_REQUEST_LPUART1_TX        36U  /*!< DMAMUX1 LP_UART1_RX request */

#define DMA_REQUEST_SAI1_A            37U  /*!< DMAMUX1 SAI1 A request    */
#define DMA_REQUEST_SAI1_B            38U  /*!< DMAMUX1 SAI1 B request    */
#define DMA_REQUEST_SAI2_A            39U  /*!< DMAMUX1 SAI2 A request    */
#define DMA_REQUEST_SAI2_B            40U  /*!< DMAMUX1 SAI2 B request    */

#define DMA_REQUEST_OCTOSPI1          41U  /*!< DMAMUX1 OCTOSPI1 request  */

#define DMA_REQUEST_TIM1_CH1          42U  /*!< DMAMUX1 TIM1 CH1 request  */
#define DMA_REQUEST_TIM1_CH2          43U  /*!< DMAMUX1 TIM1 CH2 request  */
#define DMA_REQUEST_TIM1_CH3          44U  /*!< DMAMUX1 TIM1 CH3 request  */
#define DMA_REQUEST_TIM1_CH4          45U  /*!< DMAMUX1 TIM1 CH4 request  */
#define DMA_REQUEST_TIM1_UP           46U  /*!< DMAMUX1 TIM1 UP  request  */
#define DMA_REQUEST_TIM1_TRIG         47U  /*!< DMAMUX1 TIM1 TRIG request */
#define DMA_REQUEST_TIM1_COM          48U  /*!< DMAMUX1 TIM1 COM request  */

#define DMA_REQUEST_TIM8_CH1          49U  /*!< DMAMUX1 TIM8 CH1 request  */
#define DMA_REQUEST_TIM8_CH2          50U  /*!< DMAMUX1 TIM8 CH2 request  */
#define DMA_REQUEST_TIM8_CH3          51U  /*!< DMAMUX1 TIM8 CH3 request  */
#define DMA_REQUEST_TIM8_CH4          52U  /*!< DMAMUX1 TIM8 CH4 request  */
#define DMA_REQUEST_TIM8_UP           53U  /*!< DMAMUX1 TIM8 UP  request  */
#define DMA_REQUEST_TIM8_TRIG         54U  /*!< DMAMUX1 TIM8 TRIG request */
#define DMA_REQUEST_TIM8_COM          55U  /*!< DMAMUX1 TIM8 COM request  */

#define DMA_REQUEST_TIM2_CH1          56U  /*!< DMAMUX1 TIM2 CH1 request  */
#define DMA_REQUEST_TIM2_CH2          57U  /*!< DMAMUX1 TIM2 CH2 request  */
#define DMA_REQUEST_TIM2_CH3          58U  /*!< DMAMUX1 TIM2 CH3 request  */
#define DMA_REQUEST_TIM2_CH4          59U  /*!< DMAMUX1 TIM2 CH4 request  */
#define DMA_REQUEST_TIM2_UP           60U  /*!< DMAMUX1 TIM2 UP  request  */

